{"home":{"heroText":"Crawford County<br>\nHistorical Society","heroImage":"hero.png","alert":"The Crawford County Historical <a href=\"https://google.com\">test</a> Museum is open for the 2024 season! Open Tuesday to Saturday, 10am to 4pm. Closed for the Memorial Day holiday.","promoIcon1":"camera","promoHeader1":"Crawford County History","promoBody1":"Learn more about Crawford County through historical photographs and information.","promoLinkLabel1":"Explore the Past","promoLinkUrl1":"/history","promoIcon2":"calendar","promoHeader2":"Museum Exhibits","promoBody2":"Crawford County through the ages including  AuSable River, Fish Hatchery, and the National Guard’s Camp Grayling.","promoLinkLabel2":"Learn about our showcases","promoLinkUrl2":"/exhibits","promoIcon3":"groups","promoHeader3":"Show Your Support","promoBody3":"Find out ways you can help the museum from day-to-day operations to long term success.","promoLinkLabel3":"Help our museum","promoLinkUrl3":"/support"},"footer":{"promoHeader1":"Contact Us","promoBody1":"97 East Michigan Avenue<br>\nP.O. Box 218<br>\nGrayling, MI 49738<br>\n<br>\n989-745-3493","promoHeader2":"Hours","promoBody2":"Tuesday to Saturday<br>\n10am - 4pm","promoHeader3":"Donate Now","promoBody3":"#donate-button"},"about":{"heroImg":"michigan-ave.png","pageName":"About Us","textBlockBody1":"The Crawford County Historical Society and Museum is a non-governmental, 501c3 non-profit corporation, dedicated to “Collecting, Preserving and Interpreting Documents and Artifacts that illustrate the history of Crawford County, Michigan”.","textBlockTitle2":"What we do","textBlockBody2":"We collect documents and artifacts mostly through donations from the descendents of the early area pioneers. Items range from the Native American cultures through the lumbering industry and early railroads on through the family histories of the first settlers. Most of the items collected require some sort of preservation that may range from simply being placed in a protected showcase to being kept in a climate controlled environment. For instance, early documents and photographs need to be mounted under acid-free matting behind UV filtered glass.<br>\n<br>\nThese activities require both time and funding.<br>\n<br>\nWe are fortunate to have the old Railway Depot to house our collection but it’s expensive to pay for the electric bill, gas bill, phone service and general building and grounds maintenance. Archival preservation supplies are also costly. In addition it does no good to the community to simply store the “stuff” away where no one can see or read about those early days. Exhibits need to be assembled that tell a story.","textBlockTitle3":"How we are funded","textBlockBody3":"The Museum is funded exclusively through donations, sponsorships and the occasional grant. There are no tax dollars being used. Consequently there is usually a substantial gap between what we need and what we receive. Thanks to the generosity of a few committed people, we continue to pay the bills and manage to keep our counties history intact and available for all to enjoy.","textBlockTitle4":"What we need","textBlockBody4":"Without a doubt, the most vital component to the museum’s success are our volunteers. Without them, the rest of the parts just do not exist. Volunteers are the ingredient that make the Museum possible. Volunteers do the research that helps tell the stories behind our collections. Volunteers welcome visitors and introduce them to the numerous aspects of our history. Volunteers help develop the displays that tell the stories. New volunteers are trained to understand what the Museum contains and what it means before they are placed on the front desk. It’s a great experience to discover the many chapters of our county’s history. It’s even better to share our rich history with visitors from all over our nation who journey to Crawford County to hunt, fish, camp, see the fall colors or to just enjoy the great “Up North” experience.","textBlockTitle5":"Ways you can support","textBlockBody5":"There are many ways to support the museum. It may be as a one-time donor or by committing to an on-going annual pledge. Supporters may chose to sponsor a specific exhibit or offer a gift in memory of a former Crawford County resident. In addition, folks who wish to volunteer their time to become a part of our volunteer team are always welcome. Regardless of how little or how much, it all helps to make the Crawford County Historical Museum something we may all be very proud of.<br>\n<br>\nClick <a href=\"/about/support\">here</a> if you are interested in helping out with donations, a sponsorship or becoming a volunteer."},"navbar":[{"label":"About","value":"/about"},{"label":"Board","value":"/board"},{"label":"Events","value":"/events"},{"label":"Exhibits","value":"/exhibits"},{"label":"Support","value":"/support"},{"label":"Contact","value":"/contact"}],"events":{"pageName":"Events","heroImg":"michigan-ave.png"},"eventspanels":[{"month":"June","day":"8","header":"Sell your New and Used Recreational Equipment","body":"at the Crawford County Historical Museum Sale","scheduled":"Saturday, June 8 from 9am to 5pm","linkLabel":"Read More","linkUrl":"https://crawfordcountyhistoricalsociety.com/assets/docs/cchs-used-equipment-sale_240608.pdf"}],"contact":{"pageName":"Contact Us","textBlockTitle1":"Address","textBlockBody1":"97 East Michigan Avenue<br>\nP.O. Box 218<br>\nGrayling, MI 49738<br>\n989-745-3493","textBlockTitle2":"Hours","textBlockBody2":"Tuesday - Saturday: 10am - 4pm<br>\nSunday - Monday: Closed","textBlockTitle3":"Contact Us","textBlockBody3":"Email: cchsgrayling@gmail.com<br>\nPhone: 989-745-3493"},"support":{"pageName":"Support","description":"There are many ways to support the Crawford County Historical Society and Museum","blockHeader1":"Volunteer Your Time","blockBody1":"Volunteers are a vital component of the museum’s success. We welcome all volunteers no matter if you have a little time to offer or a lot. In addition, we have a variety of areas where you can dedicate your time, depending on your interests.<br>\n<br>\nHelp us do research<br>\nHelp us create the exhibits and displays<br>\nWork at the welcome desk and greet visitors who come from all parts of the country<br>\nTo volunteer your time, contact the museum on 989-348-4461.","blockHeader2":"Donate to help with the Day-to-Day Operations of the Museum","blockBody2":"A donation to the Crawford County Historical Society is a donation that helps to keep the museum up and running. Your donation helps to pay the bills and continue to preserve the history of the county.<br>\n<br>\nThe Crawford County Historical Society and Museum welcomes any kind of donation, sponsorship or grant. You can be a one-time donor or make a commitment to an ongoing annual pledge. You may also want to consider sponsoring a specific exhibit and offer a gift in memory of a former Crawford County resident. All donations, big and small, are welcome.<br>\n<br>\nIf you would like to donate to the CCHS, you can do so online through paypal, or please send your check made payable to CCHS to: CCHS, 97 East Michigan Avenue, P.O. Box 218, Grayling, MI 49738","blockHeader3":"Donate to the long-term success of the Historical Society and Museum","blockBody3":"The Crawford County Historical Society Foundation Fund was established in 2009. It was created to provide long-term financial support for the historical society and museum. Donations to the fund are invested in a larger fund called the Community Foundation for Northeast Michigan. Donations can be made in the following manner:<br>\n<br>\nOutright gifts of cash, securities, real estate and/or personal property<br>\nBequests by will of cash or property<br>\nLife insurance naming the Foundation Fund as the beneficiary and owner<br>\nMemorial tributes in honor of a friend or loved one<br>\nPrivate foundation transfer<br>\nIf you would like to make a contribution, checks can be made payable to the Crawford County Historical Society Foundation Fund (or CCHSFF). Send your donation to: Community Foundation for Northeast Michigan, 111 Water Street, P.O. Box 495, Alpena, Michigan 49707"},"board":{"heroImg":"michigan-ave.png","pageName":"Board of Directors","listTitle":"Crawford County Historical Society Board of Directors:","paragraph1":"The Board of Directors meets on the second Tuesday of every month at 3pm.","paragraph2":"From April to September, meetings are held at the Museum, which is located at:","address2":"97 East Michigan Avenue<br>\nGrayling, MI 49738","paragraph3":"From October to March, the board meets at the Grayling Township Hall, which is located at:","address3":"2090 Viking Way<br>\nGrayling, MI 49738","paragraph4":"To contact the board of directors or a specific member of the board, please call the Crawford County Historical Society on 989-745-3493. Someone will get back with you as soon as possible"},"boardlist":[{"title":"Gail Thomas","position":"President"},{"title":"Terry Lindeman","position":"Vice-President"},{"title":"Jack Pilon","position":"Treasurer"},{"title":"Tad Randolph","position":"Secretary"},{"title":"Carl Yost","position":"Board Member"},{"title":"Guy Putman","position":"Board Member"},{"title":"Karri Vinton","position":"Board Member"}]}